Autodesk.Revit.DB.DirectShapeTypeOptions.IsValid
Determines whether a DirectShapeTypeOptions is internally consistent (valid).
Remarks:
This is currently a placeholder and always returns true. Will be made public_api and a validator when it does something useful.
Since:
2021

Autodesk.Revit.DB.DirectShapeTypeOptions.IsEqualTo(Autodesk.Revit.DB.DirectShapeTypeOptions)
Compare this object with the one supplied as argument.
Return true if the options specified by both objects are the same.
other:
the DirectShapeTypeOptions object to be compared.
Returns:
True if both objects specify the same options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.DirectShapeTypeOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectShapeTypeOptions.AllowDuplicateNames
Determines whether or not duplicate DirectShapeType names are allowed.
Since:
2021

Autodesk.Revit.DB.DirectShapeTypeOptions.#ctor
Constructs a new DirectShapeTypeOptions instance with default settings.
Since:
2021

Autodesk.Revit.DB.DirectShapeTypeOptions
This class is used to control behavior of a DirectShapeType object.
Remarks:
Use Enable/Disable functions to change the default behavior.
Use DirectShapeType.SetOptions to modify that object's behavior.
Since:
2021